common/xrd-automated-tests/mock/queries/testservice_bodyMassIndex_TS2OWNER_sub.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xrd="http://x-road.eu/xsd/xroad.xsd"
        xmlns:id="http://x-road.eu/xsd/identifiers"
        xmlns:ns1="http://producer.x-road.eu">
           <soapenv:Header>
              <xrd:protocolVersion>4.0</xrd:protocolVersion>
              <xrd:issue>12345</xrd:issue>
              <xrd:userId>EE12345678901</xrd:userId>
              <xrd:id>{uuid}</xrd:id>
              <xrd:service id:objectType="SERVICE">
                 <id:xRoadInstance>XTEE-CI-XM</id:xRoadInstance>
                 <id:memberClass>COM</id:memberClass>
                 <id:memberCode>CLIENT1</id:memberCode>
                 <!--Optional:-->
                 <id:subsystemCode>testservice</id:subsystemCode>
                 <id:serviceCode>bodyMassIndex</id:serviceCode>
                 <!--Optional:-->
                 <id:serviceVersion>v1</id:serviceVersion>
              </xrd:service>
              <xrd:client id:objectType="MEMBER">
                 <id:xRoadInstance>XTEE-CI-XM</id:xRoadInstance>
                 <id:memberClass>COM</id:memberClass>
                 <id:memberCode>00000002</id:memberCode>
                 <!--Optional:-->
                 <id:subsystemCode>sub</id:subsystemCode>
              </xrd:client>
           </soapenv:Header>
           <soapenv:Body>
            <ns1:bodyMassIndex>
                <request>
                 <weight>75</weight>
                 <height>180</height>
                </request>
            </ns1:bodyMassIndex>
           </soapenv:Body>
</soapenv:Envelope>
